app/controllers/articles_controller.rb

  def create
    Article.create(text: article_params[:text], user_id: current_user.id)
---
INSERT INTO `articles` (`text`, `created_at`, `updated_at`, `user_id`) VALUES ('aaa\r\naaaa', '2019-05-06 09:24:45', '2019-05-06 09:24:45', 1)

  def update
    article = Article.find(params[:id])
    article.update(article_params) if article.user_id == current_user.id
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `text` = 'aa', `updated_at` = '2019-05-03 06:17:23' WHERE `articles`.`id` = 1

  def destroy
    article = Article.find(params[:id])
    article.destroy if article.user_id == current_user.id
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1